[
  {
    "Title": "Sovereign Powers Could Be Key to Mass Crypto Adoption - CoinDesk",
    "Link": "https://www.coindesk.com/sovereign-powers-could-be-key-to-mass-crypto-adoption",
    "Description": "A statist approach to blockchain development, like other industrial policies in the past, might yet prove successful in this market.",
    "source": "www.coindesk.com"
  },
  {
    "Title": "YouTube Calls Crypto Purge a Mistake But Many Videos Still Missing - CoinDesk",
    "Link": "https://www.coindesk.com/youtube-calls-crypto-purge-a-mistake-but-many-videos-still-missing",
    "Description": "YouTube shut down dozens of crypto videos in a move that it admits was a mistake.",
    "source": "www.coindesk.com"
  },
  {
    "Title": "Ethereum's 'Bazaar' Development Model Will Pay Off in 2020 - CoinDesk",
    "Link": "https://www.coindesk.com/ethereums-bazaar-development-model-will-pay-off-in-2020",
    "Description": "2020 is Ethereum 2.0’s year of delivery. We just have to trust in the community's unusual model of development, says ConsenSys's Eth2 adviser. ",
    "source": "www.coindesk.com"
  },
  {
    "Title": "Taxation Of Cryptoassets For Businesses - BISS Research",
    "Link": "https://www.bissresearch.com/taxation-of-cryptoassets-for-businesses/",
    "Description": "HMRC confirms that cryptoassets are not considered to be money or currency for tax purposes.",
    "source": "www.bissresearch.com"
  },
  {
    "Title": "You Can Now Buy Ripple's XRP on Binance by Directly Adding Your Visa Card",
    "Link": "https://u.today/you-can-now-buy-ripples-xrp-on-binance-by-directly-adding-your-visa-card",
    "Description": "Ripple's XRP, Bitcoin (BTC), and Ethereum (ETH) can now be directly bought on Binance with the help of your credit card",
    "source": "u.today"
  },
  {
    "Title": "Ethereum's Vitalik Buterin Denies Sending $11.5 Mln Worth of ETH to Kraken",
    "Link": "https://u.today/ethereums-vitalik-buterin-denies-sending-115-mln-worth-of-eth-to-kraken",
    "Description": "Ethereum co-founder Vitalik Buterin says that he has no idea what to whom belongs the address that $11 mln worth of ETH to Kraken the other day",
    "source": "u.today"
  },
  {
    "Title": "EOS Co-Founder Concerned with Censorship Techno Monopolists May Bring – First YouTube, Then Amazon",
    "Link": "https://u.today/eos-co-founder-concerned-with-censorship-techno-monopolists-may-bring-first-youtube-then-amazon",
    "Description": "Following the crypto purge on Google’s YouTube, the EOS co-founder Dan Larimer is concerned this could be just a beginning of censorship by key players on the market",
    "source": "u.today"
  },
  {
    "Title": "Bitcoin (BTC) Price Prediction: Can Bulls Hold the $7,000 Level while at a Crossroads?",
    "Link": "https://u.today/bitcoin-btc-price-prediction-can-bulls-hold-the-7000-level-while-at-a-crossroads",
    "Description": "Do the bulls have enough strength to keep Bitcoin above $7,000 through the last days of 2019?",
    "source": "u.today"
  },
  {
    "Title": "I Survived on Bitcoin for 14 Days | Cointelegraph Documentary",
    "Link": "https://www.youtube.com/watch?v=HpwETE2m57A&feature=youtu.be",
    "Description": "Our video journalist put crypto to the ultimate test — by attempting to live on Bitcoin for 14 days in the financial center of the world. Will he succeed? Bi...",
    "source": "www.youtube.com"
  },
  {
    "Title": "Bitcoin Is the Only Asset Class in the World That Is Not Rallying: Peter Schiff",
    "Link": "https://u.today/bitcoin-is-the-only-asset-class-in-the-world-that-is-not-rallying-peter-schiff",
    "Description": "Gold bug Peter Schiff twists the knife in the wounded crypto community by saying that Bitcoin is the only asset that is not rallying at the moment",
    "source": "u.today"
  },
  {
    "Title": "Ripple's XRP Is Being Adopted by Almost Every Japanese Bank: CipherTrace CEO",
    "Link": "https://u.today/ripples-xrp-is-being-adopted-by-almost-every-japanese-bank-ciphertrace-ceo",
    "Description": "Almost every Japanese bank is starting to work with Ripple's XRP, says CipherTrace CEO David Jevans",
    "source": "u.today"
  },
  {
    "Title": "Eminer: A Brand New BTC Mining Method | Coinspeaker",
    "Link": "https://www.coinspeaker.com/eminer-a-brand-new-btc-mining-method/",
    "Description": "Eminer is a blockchain financial service platform that integrates computing power services, financial services, circulation services, and information services.",
    "source": "www.coinspeaker.com"
  },
  {
    "Title": "Here’s What Bitcoin’s Surge Off Its Daily Lows Says About Where It’s Heading Next",
    "Link": "https://www.newsbtc.com/2019/12/28/heres-what-bitcoins-surge-off-its-daily-lows-says-about-where-its-heading-next/",
    "Description": "Analysts are explaining that bull’s ability to defend against further losses points to the possibility that Bitcoin (BTC) will soon see further upside.",
    "source": "www.newsbtc.com"
  },
  {
    "Title": "Why a Fund Manager Thinks Bitcoin Will Rally 25% to $9,000 In 1 Month",
    "Link": "https://www.newsbtc.com/2019/12/28/fund-manager-thinks-bitcoin-rally-25-9000-one-month/",
    "Description": "Over the holiday season, Bitcoin (BTC) has stalled in the low-$7,000s, finding itself stuck between a rock and a hard place. Although some say that this",
    "source": "www.newsbtc.com"
  },
  {
    "Title": "$1 Mln Bitcoin Price Prediction Made by Hedge Fund Manager James Altucher Has Four Days Left",
    "Link": "https://u.today/1-mln-bitcoin-price-prediction-made-by-hedge-fund-manager-james-altucher-has-four-days-left",
    "Description": "The price of Bitcoin needs to surge 13,788 percent in four days for James Altucher's prediction to come into fruition",
    "source": "u.today"
  },
  {
    "Title": "'A Clear Threat': Big Four Australian Bank Fears Facebook's Crypto Libra",
    "Link": "https://www.ccn.com/a-clear-threat-big-four-australian-bank-fears-facebooks-crypto-libra/",
    "Description": "Facebook takes aim at the traditional banking system with the Libra cryptocurrency.",
    "source": "www.ccn.com"
  },
  {
    "Title": "Secret's Out: Goldman Sachs is Scouting its Cryptocurrency Chief",
    "Link": "https://www.ccn.com/secrets-out-goldman-sachs-is-scouting-its-cryptocurrency-chief/",
    "Description": "Goldman Sachs is hiring a project manager to develop distributed ledger products, but they're as likely as JP Morgan to make a BlandCoin.",
    "source": "www.ccn.com"
  },
  {
    "Title": "PARSIQ’s new blockchain monitoring platform brings additional security and stability to exchanges and stablecoins - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/parsiqs-new-blockchain-monitoring-platform-brings-additional-security-and-stability-to-exchanges-and-stablecoins/",
    "Description": "For anything beyond basic analysis, the current generation of block explorers are not up to scratch. PARSIQ believes its new blockchain monitoring and intelligence platform will change all that, allow",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "Gibraltar increasingly recognised as DLT jurisdiction of choice - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/pressrelease/gibraltar-increasingly-recognised-as-dlt-jurisdiction-of-choice/",
    "Description": "ISOLAS partner and thought leader on regulatory issues around digital assets, Joey Garcia, was invited to speak at a conference at the world-leading Wharton Business School. The conference, hosted at ",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "With SEC Battles Brewing, What is the Path Forward for Crypto Regulations? - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/with-sec-battles-brewing-what-is-the-path-forward-for-crypto-regulations/",
    "Description": "In light of Kik’s recent announcement of a crowdfunding campaign to bring about a new Howey Test for cryptocurrencies as well as a statement from SEC Director of Corporation Finance William Hinman reg",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "ISOLAS showcases Gibraltar’s growing DLT developments - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/pressrelease/isolas-showcases-gibraltars-growing-dlt-developments/",
    "Description": "Law firm ISOLAS LLP was once again involved in an exciting month of developments in Gibraltar’s Distributed Ledger Technology (DLT) industry. Last Wednesday (5th June) saw the last day of the Universi",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "Facebook Libra's USD-EUR-GBP-JPY-SGD Crypto Basket May Reject China's Yuan",
    "Link": "https://www.ccn.com/facebook-fiat-crypto-libra-reject-yuan/",
    "Description": "The basket of fiat currencies in the line up to back Facebook's Libra \"cryptocurrency\" will not likely include the Chinese Yuan.",
    "source": "www.ccn.com"
  },
  {
    "Title": "Everledger Drives Increased Transparency in Supply Chains with New Version of its Blockchain Platform - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/pressrelease/everledger-drives-increased-transparency-in-supply-chains-with-new-version-of-its-blockchain-platform/",
    "Description": "Industries from Diamonds to Luxury Goods will benefit from the convergence of blockchain technology with responsible business practices. Everledger, the digital transparency company, has launched vers",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "Bitcoin price gains: Did Bitcoin mining just become profitable again? - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/bitcoin-price-gains-did-bitcoin-mining-just-become-profitable-again/",
    "Description": "As Bitcoin enjoys a record week of price rises, we look at the profitability of mining Bitcoin now the prices has surpassed $7,000. On the 15th December 2018, Bitcoin recorded its most recent low pric",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "World's Biggest Banks Splash $63 million on a Blockchain Digital Currency",
    "Link": "https://www.ccn.com/biggest-banks-63-million-blockchain-digital-currency/",
    "Description": "Some of the world's biggest banks are partnering with London-based Fnality International to create a blockchain digital currency",
    "source": "www.ccn.com"
  },
  {
    "Title": "France Financial Authority Announces New Rules for Digital Asset Providers | Coinspeaker",
    "Link": "https://www.coinspeaker.com/france-financial-authority-new-rules-digital-asset-providers/",
    "Description": "The top financial regulatory authority in France, the AMF, has unveiled new rules for digital asset providers in the country to follow.",
    "source": "www.coinspeaker.com"
  },
  {
    "Title": "Cryptocurrency Video Removals is a Mistake, YouTube Says | Coinspeaker",
    "Link": "https://www.coinspeaker.com/cryptocurrency-video-removals-mistake-youtube-says/",
    "Description": "The video-sharing giant YouTube had committed an error in deleting the videos that promote or had anything to do with cryptocurrencies.",
    "source": "www.coinspeaker.com"
  },
  {
    "Title": "Ripple Aims at Wider XRP Expansion in Brazil in 2020",
    "Link": "https://u.today/ripple-aims-at-wider-xrp-expansion-in-brazil-in-2020",
    "Description": "The crypto decacorn Ripple after the numerous milestones in 2019 plans to continue expansion in Brazil next year",
    "source": "u.today"
  },
  {
    "Title": "Vitalik Buterin Bewildered at YouTube Allegedly Censoring Ethereum 2016 Roadmap Video",
    "Link": "https://u.today/vitalik-buterin-bewildered-at-youtube-allegedly-censoring-ethereum-2016-roadmap-video",
    "Description": "As the crypto purge continues, one of the banned videos was about Ethereum back in 2016, Vitalik says it’s weird, meanwhile legal experts are justifying the crypto purge",
    "source": "u.today"
  },
  {
    "Title": "TOP 3 Price Predictions for BTC, ETH, XRP: Expecting Bullish Tendencies on New Year's Eve",
    "Link": "https://u.today/top-3-price-predictions-for-btc-eth-xrp-expecting-bullish-tendencies-on-new-years-eve",
    "Description": "Should we expect a bull run by the end of the New Year?",
    "source": "u.today"
  },
  {
    "Title": "Bitcoin Price May Show High Volatility Jumps as BitMEX Futures to Expire on Friday, Expert Says",
    "Link": "https://u.today/bitcoin-price-may-show-high-volatility-jumps-as-bitmex-futures-to-expire-on-friday-expert-says",
    "Description": "BitMEX XBTZ19 futures contracts to expire on December 27, a prominent analyst Jacob Canfield warns that this may result in high Bitcoin price volatility",
    "source": "u.today"
  },
  {
    "Title": "'Fake Satoshi' Craig Wright Says He Has Zero Access to His BTC Fortunes",
    "Link": "https://u.today/fake-satoshi-craig-wright-says-he-has-zero-access-to-his-btc-fortunes",
    "Description": "The self-assumed BTC inventor Craig Wright says he cannot return the BTC he owes to the Kleiman estate, since he can’t access the private keys to unlock it",
    "source": "u.today"
  },
  {
    "Title": "Bitcoin Cash (BCH) Price Reaches New All-Time Low Against Bitcoin (BTC)",
    "Link": "https://u.today/bitcoin-cash-bch-price-reaches-new-all-time-low-against-bitcoin-btc",
    "Description": "Bitcoin Cash (BCH) bears are in full force as the contentious fork drops to its lowest level against Bitcoin (BTC)",
    "source": "u.today"
  },
  {
    "Title": "Blockchain Is Vital Component for UN’s Future, Secretary-General Insists",
    "Link": "https://u.today/blockchain-is-vital-component-for-uns-future-secretary-general-insists",
    "Description": "The UN secretary-general believes that the UN must adopt blockchain since it can help build ‘a more sustainable world’",
    "source": "u.today"
  },
  {
    "Title": "Updated: $25 Mln Worth of Ethereum (ETH) Has Been Sent to Top Exchanges. Is Major Sell-Off Imminent?",
    "Link": "https://u.today/updated-25-mln-worth-of-ethereum-eth-has-been-sent-to-top-exchanges-is-major-sell-off-imminent",
    "Description": "Ethereum (ETH) seems to be on the verge of another sell-off with someone moving more than $25 mln worth of ETH to numerous exchanges",
    "source": "u.today"
  },
  {
    "Title": "Bitcoin Price to Reach $9,000 Before 2020 Ends, Crypto Analysis Says",
    "Link": "https://u.today/bitcoin-price-to-reach-9000-before-2020-ends-crypto-analysis-says",
    "Description": "The situation with Bitcoin looks similar to that of 2017 when everybody looked the other way and then the price skyrocketed, an analyst says",
    "source": "u.today"
  },
  {
    "Title": "J.Lo and A-Rod Backed a Fintech Play. They Should Invest in Bitcoin Next",
    "Link": "https://www.ccn.com/j-lo-and-a-rod-invested-in-fintech-they-should-invest-in-bitcoin-next/",
    "Description": "Jennifer Lopez and Alex Rodiguez invested in the fintech firm Acorns Grow Incorporated. They should buy bitcoin next. Here's why.",
    "source": "www.ccn.com"
  },
  {
    "Title": "Crypto Will Never Become Mainstream, Says ZenGo CEO, Here’s Why",
    "Link": "https://u.today/crypto-will-never-become-mainstream-says-zengo-ceo-heres-why",
    "Description": "The CEO of the ZenGo wallet doubts that cryptocurrency will ever become mainstream and offers his reasons to the community on that",
    "source": "u.today"
  },
  {
    "Title": "North Korea is \"Developing its Own Cryptocurrency\" - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/north-korea-is-developing-its-own-cryptocurrency/",
    "Description": "The North Korean government is reportedly working on developing its own cryptocurrency to avoid international sanctions and counter a financial system dominated by the United States and Western Countr",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "Facebook allows crypto ads again - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/facebook-allows-crypto-ads-again/",
    "Description": "Last night, Facebook announced it is reversing its June 2018 decision to ban cryptocurrency-related ads from its platform.In a blog post, Facebook said it had “listened to feedback and assessed the po",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "Own partners with CryptoTax to offer blockchain certified tax solutions - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/pressrelease/own-partners-with-cryptotax-to-offer-blockchain-certified-tax-solutions/",
    "Description": "Own, creator of pioneering investment technology, will become the first global blockchain provider to offer integrated certified tax solutions to its users, after entering into a strategic partnership",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "Buy High: Bitcoin (BTC) Compared to Cannabis Stocks by Fundstrat's Tom Lee",
    "Link": "https://u.today/buy-high-bitcoin-btc-compared-to-cannabis-stocks-by-fundstrats-tom-lee",
    "Description": "Tom Lee compares the crash of the biggest cannabis stocks to the crypto mania",
    "source": "u.today"
  },
  {
    "Title": "Bitcoin Is Less Useful Than Gold, Says Billionaire Mark Cuban",
    "Link": "https://u.today/bitcoin-is-less-useful-than-gold-says-billionaire-mark-cuban",
    "Description": "Mark Cuban seemingly prefers gold over Bitcoin, according to his latest Twitter debate with the crypto community",
    "source": "u.today"
  },
  {
    "Title": "Ethereum Price to Keep Rising After Breaking $190, Crypto Traders Believe",
    "Link": "https://u.today/ethereum-price-to-keep-rising-after-breaking-190-crypto-traders-believe",
    "Description": "The second biggest coin ETH has been in the lows recently, however, analysts believe the price may spike in the near future – when certain marks on the chart are behind",
    "source": "u.today"
  },
  {
    "Title": "Crypto's Gender Divide Surfaces: Only 5% of Coders Are Women",
    "Link": "https://www.ccn.com/cryptos-gender-divide-coders-women/",
    "Description": "About 95% of crypto coders are men, according to a gender analysis of the 100 most popular blockchain projects posted on GitHub.",
    "source": "www.ccn.com"
  },
  {
    "Title": "Crypto Exchange Bitfinex Remains Unfazed by Its Falling Trading Volume",
    "Link": "https://u.today/crypto-exchange-bitfinex-remains-unfazed-by-its-falling-trading-volume",
    "Description": "Bitfinex CTO Paolo Ardoino explains why the exchange's shrinking volumes don't really matter",
    "source": "u.today"
  },
  {
    "Title": "XRP Price Prediction: Is there Salvation from Dropping to $0.15?",
    "Link": "https://u.today/xrp-price-prediction-is-there-salvation-from-dropping-to-015",
    "Description": "Analyzing the levels for an XRP upswing.",
    "source": "u.today"
  },
  {
    "Title": "Ripple Makes Last-Ditch Attempt to Dismiss Securities Lawsuit",
    "Link": "https://cryptocurrencynews.com/ripple-last-attempt-dismiss-securities-lawsuit/",
    "Description": "Ripple has filed a final motion to dismiss a lawsuit alleging that it held an unauthorized securities sale of its XRP tokens. Learn more inside.",
    "source": "cryptocurrencynews.com"
  },
  {
    "Title": "Bitcoin (BTC) Technical Analysis: Bitcoin Bulls Trying to Defend $3,500 Support, What Can We Expect Next? - Cryptovest",
    "Link": "https://cryptovest.com/videos/bitcoin-btc-technical-analysis-bitcoin-bulls-trying-to-defend-3500-support-what-can-we-expect-next/",
    "Description": "<p>Nothing in this article is to be construed as investment advice. Neither the author nor the publication assumes any responsibility or liability for any investments, profits or losses you may incur ",
    "source": "cryptovest.com"
  },
  {
    "Title": "Bitcoin Price: Long Term Bullish Trend Still Intact, Analyst Says",
    "Link": "https://u.today/bitcoin-price-long-term-bullish-trend-still-intact-analyst-says",
    "Description": "The Bitcoin price has been trading flat for a month already, hanging in the $7,400 area, however, a crypto analyst says that the long-term bullish trend continues",
    "source": "u.today"
  },
  {
    "Title": "How to know if a company using blockchain is all hype or the next big thing - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/how-to-know-if-a-company-using-blockchain-is-all-hype-or-the-next-big-thing/",
    "Description": "After a 2018 lull, blockchain has returned to the public consciousness in force recently thanks in part to Bitcoin’s bull run and Facebook’s announcement regarding GlobalCoin. In this environment, it’",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "OmiseGo (OMG) Blockchain Reports First-Ever Transaction on Mainnet",
    "Link": "https://u.today/omisego-omg-blockchain-reports-first-ever-transaction-on-mainnet",
    "Description": "OmiseGo (OMG), one of the last ICO-based projects directly advised by Ethereum's Vitalik Buterin,  performed its first mainnet transaction after 34 months of development.",
    "source": "u.today"
  },
  {
    "Title": "Ethereum Price to Skyrocket in 2025, If This Bullish Scenario Plays Out: Crypto Trader",
    "Link": "https://u.today/ethereum-price-to-skyrocket-in-2025-if-this-bullish-scenario-plays-out-crypto-trader",
    "Description": "Ethereum remains in the $125 area, unable to surge any higher yet, still a crypto trader explains how ETH could hit an astronomic price of $45,000 in 2025",
    "source": "u.today"
  },
  {
    "Title": "Bitcoin Price Might Not Pump After Halving. Roger Ver Explains Why",
    "Link": "https://u.today/bitcoin-price-might-not-pump-after-halving-roger-ver-explains-why",
    "Description": "Roger Ver is certain that the price of Bitcoin will no go up after the halvening due to its scaling issues",
    "source": "u.today"
  },
  {
    "Title": "China’s Crypto Could Become a Global Reserve Currency: Circle CEO",
    "Link": "https://www.ccn.com/chinas-crypto-could-become-a-global-reserve-currency-circle-ceo/",
    "Description": "Circle's Jeremy Allaire believes that China's \"crypto\" could propel the Chinese Yuan to worldwide renown as a global reserve currency.",
    "source": "www.ccn.com"
  },
  {
    "Title": "Federal Reserve's Record $235 Billion Repo Intervention Validates Bitcoin",
    "Link": "https://www.newsbtc.com/2019/12/28/federal-reserve-record-report-validates-bitcoin/",
    "Description": "While Bitcoin is an asset independent of central banks, of banks, and of Wall Street, the cryptocurrency’s strength and underlying value proposition have",
    "source": "www.newsbtc.com"
  },
  {
    "Title": "XRP’s Growth Potential Outbeats Most Coins on the Market: Crypto Investor",
    "Link": "https://u.today/xrps-growth-potential-outbeats-most-coins-on-the-market-crypto-investor",
    "Description": "XRP liquidity in its ODL corridors is rising while an investor states XRP’s growth potential is still much stronger than that of all the other crypto on the market",
    "source": "u.today"
  },
  {
    "Title": "OKEx Runs Test for Bitcoin (BTC) Options - Cryptovest",
    "Link": "https://cryptovest.com/news/okex-runs-test-for-bitcoin-btc-options/",
    "Description": "OKEx has risen as one of the leaders in BTC derivative trades, now adding options for selected traders.",
    "source": "cryptovest.com"
  },
  {
    "Title": "Ethereum’s Vitalik Buterin Takes Interest in EOS-Based Social Media Platform",
    "Link": "https://u.today/ethereums-vitalik-buterin-takes-interest-in-eos-based-social-media-platform",
    "Description": "Ethereum co-founder Vitalik Buterin reveals that he has already requested beta access to Block.one's soon-to-be-launched social media platform \"Voice\"",
    "source": "u.today"
  },
  {
    "Title": "The Ethereum Community Is No Longer Fighting With Itself - CoinDesk",
    "Link": "https://www.coindesk.com/the-ethereum-community-is-no-longer-fighting-with-itself",
    "Description": "Ethereum's infighting in 2016 and 2017 has been replaced by co-operation and alliance-building, says a veteran member of the community. ",
    "source": "www.coindesk.com"
  },
  {
    "Title": "Cardano (ADA) Technical Analysis: Will ADA Move Ahead of IOHK Summit? - Cryptovest",
    "Link": "https://cryptovest.com/videos/cardano-ada-technical-analysis-will-ada-move-ahead-of-iohk-summit/",
    "Description": "<p>Nothing in this article is to be construed as investment advice. Neither the author nor the publication assumes any responsibility or liability for any investments, profits or losses you may incur ",
    "source": "cryptovest.com"
  },
  {
    "Title": "Bitcoin Community Asks for Bitcoin Emoji, Petition Created by “Satoshi Nakamoto”",
    "Link": "https://u.today/bitcoin-community-asks-for-bitcoin-emoji-petition-created-by-satoshi-nakamoto",
    "Description": "An impersonator of the mysterious Bitcoin creator excited the crypto community with an eccentric proposal to create an official emoji for Bitcoin.",
    "source": "u.today"
  },
  {
    "Title": "European Central Bank (ECB) publishes white paper on its own cryptocurrency - The Bitcoin News",
    "Link": "https://thebitcoinnews.com/european-central-bank-ecb-publishes-white-paper-on-its-own-cryptocurrency/",
    "Description": "The European Central Bank announced a stage win in the global race for the first introduction of a digital central bank currency (CBDC). In the whitepaper published on December 17, the ECB presents th",
    "source": "thebitcoinnews.com"
  },
  {
    "Title": "3C Exchange Review: Simple Cryptocurrency Exchange and Automated Trading",
    "Link": "https://cryptopotato.com/3c-exchange-review-simple-cryptocurrency-exchange-and-automated-trading/",
    "Description": "Featured Cryptocurrency trading has gone a long way in the past few years. As Bitcoin and other major altcoins gained serious traction following their",
    "source": "cryptopotato.com"
  },
  {
    "Title": "Ethereum Price Analysis: At $130, ETH Loses Steam Against Bitcoin, What's Next?",
    "Link": "https://cryptopotato.com/ethereum-price-analysis-at-130-eth-looses-steam-against-bitcoin-can-the-bulls-turn-it-around/",
    "Description": "Ethereum slipped by a further 5% this week, bringing the price for the cryptocurrency down to the $130 level. ETH created a fresh 3-month low against BTC",
    "source": "cryptopotato.com"
  },
  {
    "Title": "Asia’s Love Affair With Blockchain Is Blossoming - The Bitcoin News",
    "Link": "https://thebitcoinnews.com/asias-love-affair-with-blockchain-is-blossoming/",
    "Description": "Far away from western eyes, Asian blockchain projects are thriving. A vibrant ecosystem of public and permissioned chains has sprung to life in Asia, aided by government and big business endorsement o",
    "source": "thebitcoinnews.com"
  },
  {
    "Title": "Bitcoin and Crypto Advanced Technical Analysis",
    "Link": "https://cryptopotato.com/bitcoin-crypto-advanced-technical-analysis/",
    "Description": "The unique characteristics of the cryptocurrency markets have made technical analysis and charting invaluable tools. Learn all about them here!",
    "source": "cryptopotato.com"
  },
  {
    "Title": "Bitcoin Price Might Not Go Up After Halvening. Coinshares CSO Meltem Demirors Explains Why",
    "Link": "https://u.today/bitcoin-price-might-not-go-up-after-halvening-coinshares-cso-meltem-demirors-explains-why",
    "Description": "The mushrooming growth of the derivatives market will stifle Bitcoin's price action after the next halvening",
    "source": "u.today"
  },
  {
    "Title": "As FATF Regulations Galvanize, Crypto Mixing Applications Are Targeted - The Bitcoin News",
    "Link": "https://thebitcoinnews.com/as-fatf-regulations-galvanize-crypto-mixing-applications-are-targeted/",
    "Description": "Since the inception of Bitcoin, governments have tried to keep track of all the transactions taking place on the public blockchain. As the years progressed, authorities have shown a distaste for crypt",
    "source": "thebitcoinnews.com"
  },
  {
    "Title": "Research: More companies turning to mainframes for blockchain initiatives - CryptoNewsReview",
    "Link": "https://cryptonewsreview.com/research-more-companies-turning-to-mainframes-for-blockchain-initiatives/",
    "Description": "New research suggests mainframe technology is a key part of many business’ blockchain plans  Go by the standard cliché, and mainframe technology is legacy and for the past, whilst blockchain is cuttin",
    "source": "cryptonewsreview.com"
  },
  {
    "Title": "Why a Bitcoin Cash-Dash Merger Would Be Awful - The Bitcoin News",
    "Link": "https://thebitcoinnews.com/why-a-bitcoin-cash-dash-merger-would-be-awful/",
    "Description": "Blockchains faced fierce competition in 2019, with only a handful of altcoins remaining in good condition. Now, a new proposal has been made, a hypothetical merger of Dash and Bitcoin Cash. Both Bitco",
    "source": "thebitcoinnews.com"
  },
  {
    "Title": "Binance Announces Tezos Support and Acquisition of Dapp Platform",
    "Link": "https://cryptocurrencynews.com/binance-tezos-staking-dappreview/",
    "Description": "Binance, the world's second-largest crypto exchange by daily volume, has announced its acquisition of DappReview and that it will support Tezos staking.",
    "source": "cryptocurrencynews.com"
  },
  {
    "Title": "The number of billionaires buying Bitcoins is growing - The Bitcoin News",
    "Link": "https://thebitcoinnews.com/the-number-of-billionaires-buying-bitcoins-is-growing/",
    "Description": "The youngest US billionaire to go public with his BTC purchase is philanthropist Bill Pulte, who wants to promote crypto adoption. “I recently bought 11 bitcoins,” is a phrase that many of us would lo",
    "source": "thebitcoinnews.com"
  },
  {
    "Title": "European Blockchain Convention Barcelona - Cryptovest",
    "Link": "https://cryptovest.com/events/european-blockchain-convention-barcelona/",
    "Description": "Cryptovest - World's largest cryptocurrency and ICO media publisher offers the latest news, reviews and knowledge centre.",
    "source": "cryptovest.com"
  },
  {
    "Title": "Bitcoin (BTC), Crypto Projects Keep Facing Censorship from YouTube - Cryptovest",
    "Link": "https://cryptovest.com/news/bitcoin-btc-crypto-projects-keep-facing-censorship-from-youtube/",
    "Description": "The crypto community will enter 2020 with brand-new rules on posting crypto-related content.",
    "source": "cryptovest.com"
  },
  {
    "Title": "The Bitcoin News - leading source for Blockchain and Bitcoin News",
    "Link": "https://thebitcoinnews.com/",
    "Description": "TheBitcoinNews - leading source for Bitcoin News, Cryptocurrency and Blockchain news - visit us now for the latest Blockchain & Bitcoin News",
    "source": "thebitcoinnews.com"
  },
  {
    "Title": "Ethereum Co-founder Sold 90,000 ETH - Cryptovest",
    "Link": "https://cryptovest.com/news/ethereum-co-founder-sold-90000-eth/",
    "Description": "The whale transaction to Kraken sparked fears of concerted action, and a potential dump on Ethereum prices.",
    "source": "cryptovest.com"
  },
  {
    "Title": "Bitcoin Price Charts Indicate Strong Buying on Dips as Community Feels BTC Hopium",
    "Link": "https://u.today/bitcoin-price-charts-indicate-strong-buying-on-dips-as-community-feels-btc-hopium",
    "Description": "Crypto analysts are getting positive on the current Bitcoin fundamentals, saying that as per the charts, community is actively buying on the dip",
    "source": "u.today"
  },
  {
    "Title": "Here's why 2019 was a record-breaking year for Bitcoin | CryptoSlate",
    "Link": "https://cryptoslate.com/2019-was-a-record-breaking-year-for-bitcoin/",
    "Description": "Despite an overall bearish sentiment and high price volatility, the world’s largest cryptocurrency has had quite a successful year. From transaction count and volume, to hash rate and number of addres",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Asset manager: This key indicator means the Bitcoin bottom is in | CryptoSlate",
    "Link": "https://cryptoslate.com/asset-manager-this-key-indicator-means-the-bitcoin-bottom-is-in/",
    "Description": "Over the past few days, Bitcoin (BTC) has started to show signs of life, surging as high as $7,700 on the morning of Dec. 23. As of the time of writing this, the cryptocurrency is changing hands for $",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Bitcoin price defends key uptrend, though analysts wary of return under $7,000 | CryptoSlate",
    "Link": "https://cryptoslate.com/bitcoin-price-defends-key-uptrend-though-analysts-wary-of-return-under-7000/",
    "Description": "Bitcoin has seen quite the week, trading at $6,400, $7,400, and everywhere in between over the past seven days. As of the time of writing this, the cryptocurrency’s price has settled at $7,200, flatli",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Kim Dotcom Envisions Harsh Crypto Crackdown in the US - Cryptovest",
    "Link": "https://cryptovest.com/news/kim-dotcom-envisions-harsh-crypto-crackdown-in-the-us/",
    "Description": "In 2020, stricter rules have been planned, but there may also be unexpected crackdowns against the crypto sector.",
    "source": "cryptovest.com"
  },
  {
    "Title": "Ripple CEO & team reflect on the impact of blockchain and cryptos",
    "Link": "https://www.cryptonewsz.com/ripple-executive-team-reflects-on-the-impact-of-blockchain-digital-assets/55227/",
    "Description": "Ripple posted a video showing members of their executive team, predicting the impact of blockchain technology and digital assets in the last decade.",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "Cardano (ADA) price drops to yearly low; here are the two main factors behind the decline | CryptoSlate",
    "Link": "https://cryptoslate.com/cardano-ada-price-drops-to-yearly-low-here-are-the-two-main-factors-behind-the-decline/",
    "Description": "Despite seeing significant progress with its roadmap, Cardano (ADA) slipped to levels unseen since the bitcoin price dropped to the $3,000s.",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Is this the beginning of the HEX exit? 800 ETH withdrawn and sent to Bitfinex | CryptoSlate",
    "Link": "https://cryptoslate.com/is-this-the-beginning-of-the-hex-exit-800-eth-withdrawn-and-sent-to-bitfinex/",
    "Description": "Around 800 ETH has been withdrawn from an address associated with the HEX cryptocurrency, leading many to suspect it was the beginning of an exit scam. While there are more than 46,000 ETH left to wit",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Ripple (XRP) Price Exhibits 3% Hike Overnight - CryptoNewsZ",
    "Link": "https://www.cryptonewsz.com/ripple-xrp-price-exhibits-3-hike-overnight/55312/",
    "Description": "The crypto market is currently lifting the heavy pressure. The same has given a chance for the coins to improve. The top guns of the altcoin market like Bitcoin, Ethereum, Litecoin, Ripple etc. were a",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "FoPay Bought AliExchange for 1 Million FOIN | CryptoSlate",
    "Link": "https://cryptoslate.com/press-releases/fopay-bought-aliexchange-for-1-million-foin/",
    "Description": "Cryptocurrency Wallet service provider, FoPay announced today that it has acquired Cryptocurrency Exchange, AliExchange in a deal worth 1 million FOIN. FOIN’s 30 days average price is approximately US",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Video: StormX CEO Simon Yu on Micro Rewards and Sats Back in Bitcoin",
    "Link": "https://bitcoinmagazine.com/articles/video-stormx-ceo-simon-yu-micro-rewards-sats-back-bitcoin",
    "Description": "StormX CEO Simon Yu wants to provide thousands of bitcoin in sats-back rewards through the StormShop app and expand to Europe and Asia in 2020.\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Dogecoin Gets Trapped to Support of $0.00203 with No Immediate Respite",
    "Link": "https://www.cryptonewsz.com/dogecoin-doge-price-drops-by-2-15-over-the-last-24-hours/55260/",
    "Description": "Dogecoin has been dropped by 2.15% over last 24 hours & fell to support of 0.002039 USD. It may have to seek shelter at next support at $0.002031.",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "Ripple secures $200m investment at $10 billion valuation | CryptoSlate",
    "Link": "https://cryptoslate.com/ripple-secures-massive-investment-pushing-xrp-up-over-5/",
    "Description": "Ripple announced a massive funding round that is set to push the development and adoption of its decentralized cryptographic ledger technology.",
    "source": "cryptoslate.com"
  },
  {
    "Title": "The Largest Blockchain Educational Event Will Be Held in Hong Kong on January 15 - CryptoNewsZ",
    "Link": "https://www.cryptonewsz.com/the-largest-blockchain-educational-event-will-be-held-in-hong-kong-on-january-15/55261/",
    "Description": "10,000 participants are expected to join CHAIN2020 in Hong Kong, on January 15, which aims to become one of the largest blockchain educational conferences. CHAIN2020 launches a series of educational c",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "Bitcoin Throws Bullish Signals as it Gains Support from Daily MAs - CryptoNewsZ",
    "Link": "https://www.cryptonewsz.com/bitcoin-throws-bullish-signals-as-it-gains-support-from-daily-mas/55316/",
    "Description": "Bitcoin currently trades stably around $7,200 and $7,300 price area; at the press time, BTC was at $7,286.55. Interestingly, the king of the cryptocurrencies is trading with total support from the dai",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "MetaMask Browser Has Been Suspended From Google’s Chrome Extension Store",
    "Link": "https://www.cryptonewsz.com/metamask-browser-has-been-suspended-from-googles-chrome-extension-store/55216/",
    "Description": "The Web3 browser MetaMask took to twitter to inform that Google Play App Store has suspended their DApp browser for android users curtly citing no valid reasons behind the action. MetaMask finds it in",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "Crypto derivatives trading sees significant increase as institutional interest in the space grows | CryptoSlate",
    "Link": "https://cryptoslate.com/crypto-derivatives-trading-sees-significant-increase-as-institutional-interest-in-the-space-grows/",
    "Description": "CryptoCompare‘s November review showed a significant interest in crypto derivatives trading. While regulated bitcoin futures and options on CME are up 35.2 percent since last month, more volume was tr",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Ethereum researcher Virgil Griffith denied bail on charges of conspiring with North Korea | CryptoSlate",
    "Link": "https://cryptoslate.com/ethereum-researcher-virgil-griffith-denied-bail-on-charges-of-conspiring-with-north-korea/",
    "Description": "Virgil Griffith, the head of Ethereum’s special projects division who was arrested on federal charges of conspiracy with North Korea, has been denied bail. According to the Inner City Press, the U.S. ",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Istanbul Blockchain Week’s flagship event ‘IstanBlock’ releases limited early bird tickets | CryptoSlate",
    "Link": "https://cryptoslate.com/istanbul-blockchain-weeks-flagship-event-istanblock-releases-limited-early-bird-tickets/",
    "Description": "Turkey’s most exclusive blockchain event — IstanBlock 2020 — launches its early bird ticket sale today, amid huge excitement across the region for the first speaker announcement, expected in the comin",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Read the Latest Blockchain News – CryptoNewsZ",
    "Link": "https://www.cryptonewsz.com/category/blockchain/",
    "Description": "Get the latest news on blockchain to stay updated and learn all you need to know about Blockchain Technology.",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "Read the latest cryptocurrency news only @ CryptoNewsZ",
    "Link": "https://www.cryptonewsz.com/category/cryptocurrency/",
    "Description": "Our Cryptocurrency News feed is a one-stop destination for getting all the latest news about cryptocurrency.",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "Monero: King of Privacy Still Under the Bear’s Control - CryptoNewsZ",
    "Link": "https://www.cryptonewsz.com/monero-king-of-privacy-still-under-the-bears-control/55320/",
    "Description": "Monero is a privacy-focused decentralized Cryptocurrency that uses an obfuscated public ledger, meaning anybody can broadcast or send transactions but no outside observer can tell the source, amount o",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "CoinShares CSO: The rising popularity of Bitcoin derivatives means the 2020 halving won't push its price up | CryptoSlate",
    "Link": "https://cryptoslate.com/the-rising-popularity-of-bitcoin-derivatives-means-the-2020-halving-wont-push-its-price-up/",
    "Description": "The May 2020 Bitcoin halving might not have such a dramatic effect on Bitcoin’s price. According to Meltem Demirors, the chief strategy officer of CoinShares, the popularity of the Bitcoin derivatives",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Crypto-related videos now a target under new YouTube regulations | CryptoSlate",
    "Link": "https://cryptoslate.com/crypto-related-videos-now-a-target-under-new-youtube-regulations/",
    "Description": "YouTube is believed to be restricting crypto-related content on its platform and in some cases even deleting the flagged videos. According to NextGen’s Chris Dunn, the world’s largest video sharing pl",
    "source": "cryptoslate.com"
  },
  {
    "Title": "UCL's Paolo Tasca Shares Views on Blockchain and Academia Interlinks - CryptoNewsZ",
    "Link": "https://www.cryptonewsz.com/ucls-paolo-tasca-shares-views-on-blockchain-and-academia-interlinks/55307/",
    "Description": "Paolo Tasca, the renowned digital economist and the founder and Executive Director of the Centre for Blockchain Technologies at University College London, recently graced Ripple’s most celebrated cryp",
    "source": "www.cryptonewsz.com"
  },
  {
    "Title": "This bearish formation spells trouble for XRP; here’s where it may drop to next",
    "Link": "https://cryptoslate.com/this-bearish-formation-spells-trouble-for-xrp-heres-where-it-may-drop-to-next/",
    "Description": "XRP's bearishness is showing no signs of slowing down, as one analyst is now pointing to a technical formation that may signal it will soon drop another 20%",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Enterprise Blockchain on … Bitcoin? Bitfury Is Giving It a Go With...",
    "Link": "https://bitcoinmagazine.com/articles/enterprise-blockchain-on-bitcoin-bitfury-is-giving-it-a-go-with-exonum",
    "Description": "With Exonum Enterprise, Bitfury wants to combine the control of a private blockchain with the assurances of Bitcoin’s public chain.\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Here's why the full impact of Litecoin's August halving is yet to be seen | CryptoSlate",
    "Link": "https://cryptoslate.com/the-full-impact-of-litecoins-august-halving-is-yet-to-be-seen/",
    "Description": "Despite many arguing that the 2019 block reward halving will decimate its price, Litecoin managed to remain relatively stable. According to the latest Coin Metrics research, there could be several exp",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Billionaire's grandson Bill Pulte wants to give Bitcoin to people in Africa | CryptoSlate",
    "Link": "https://cryptoslate.com/billionaires-grandson-bill-pulte-wants-to-give-bitcoin-to-people-in-africa/",
    "Description": "Bill Pulte, the heir to the Detroit real estate giant PulteGroup, has set his sights on sending Bitcoin to those in need living in Africa. Pulte, who gained popularity by giving out hundreds of thousa",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Craig Wright produces a document explaining the origin of the name Satoshi Nakamoto | CryptoSlate",
    "Link": "https://cryptoslate.com/craig-wright-produces-a-document-explaining-the-origin-of-the-name-satoshi-nakamoto/",
    "Description": "In an interview with Modern Consensus, Craig Wright showed a document explaining the origin of his alleged alias Satoshi Nakamoto. The blurry excerpt from an academic journal seemed timestamped to ear",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Analyst: Here's why the Bitcoin multi-year trendline will break | CryptoSlate",
    "Link": "https://cryptoslate.com/the-bitcoin-multi-year-trendline-will-break-says-renowned-analyst/",
    "Description": "Some of most prominent analysts maintain that a multi-year support trendline could contain Bitcoin from a further drop, but one of them doesn't think so.",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Analysis Will The Crypto Market Recover In 2020",
    "Link": "https://www.coinjoker.in/bitcoin-news/analysis-will-the-crypto-market-recover-in-2020",
    "Description": "There were many hopes for 2019 to be a bullish year, but after a series of bearish periods, will the crypto market recover in 2020?Market analysts and crypto specialists have divided opinions",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "China to Expand it's 2nd State-Run Blockchain Platform to Global FX Markets: Report",
    "Link": "https://coingape.com/china-to-expand-its-fx-platform/",
    "Description": "China has made another important announcement on the expansion of its Blockchain project across the FX markets. While China is very close to the launch [...]",
    "source": "coingape.com"
  },
  {
    "Title": "Reasons Why Icos Are Likely To Disappear In 2020",
    "Link": "https://www.coinjoker.in/bitcoin-news/reasons-why-icos-are-likely-to-disappear-in-2020",
    "Description": "What defined the year of 2017 in the crypto world was the fulminant rise in initial coin offerings. This new crypto era spawned hundreds of new projects trying to gather funds through initial coin",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "Lumi Wallet Recalls 2019 Eos Dapps Credit Card Payments And A Special Holiday Offer",
    "Link": "https://www.coinjoker.in/bitcoin-news/lumi-wallet-recalls-2019-eos-dapps-credit-card-payments-and-a-special-holiday-offer",
    "Description": "This was a hot year for crypto, with BTC surging up from the pit it was in at the beginning of the year to a stable $7-8k by the end, rapidly developing altcoins and the rapt attention of governments",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "Ripple Xrp Price Prediction And Analysis In December 2019",
    "Link": "https://www.coinjoker.in/bitcoin-news/ripple-xrp-price-prediction-and-analysis-in-december-2019",
    "Description": "Today, we will be looking at some of the Ripple price trends and market opinions to come to an XRP price prediction for December.Ripple OverviewRipple is a distributed ledger platform that was",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "Year In Review: Top Five Cryptocurrencies In 2019",
    "Link": "https://coingape.com/top-five-cryptocurrencies-2019/",
    "Description": "While the cryptocurrency total market capitalization has retraced from yearly highs recorded in late June at $372 billion USD to $193 billion, as at time [...]",
    "source": "coingape.com"
  },
  {
    "Title": "Final countdown: Craig Wright’s 1m BTC fortune to be unlocked in 9 days | CryptoSlate",
    "Link": "https://cryptoslate.com/final-countdown-craig-wrights-1m-btc-fortune-to-be-unlocked-in-9-days/",
    "Description": "Next week, Craig Wright is set to receive the keys for more than 1 million bitcoins, the crypto community is becoming impatient to see whether the self-proclaimed Satoshi Nakamoto will deliver on its ",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Best Cryptocurrency News Apps In 2019",
    "Link": "https://www.coinjoker.in/bitcoin-news/best-cryptocurrency-news-apps-in-2019",
    "Description": "The cryptocurrency market gains popularity with each passing day, showing indications that it’s likely to go mainstream in the next few years. Consequently, more people are on the lookout for",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "Ethereum [ETH] Breaches Support As Price Set For Record Lows Against BTC",
    "Link": "https://coingape.com/eth-record-lows-against-btc/",
    "Description": "Bitcoin (BTC) has outpaced altcoins through 2019 killing off the continuous calls of “altseason” in the coming year. The pioneer crypto witnessed over 100% gains [...]",
    "source": "coingape.com"
  },
  {
    "Title": "Cardano Ada Price Prediction And Analysis In December 2019",
    "Link": "https://www.coinjoker.in/bitcoin-news/cardano-ada-price-prediction-and-analysis-in-december-2019",
    "Description": "Today, we will be analyzing some of the historical price movements of ADA as well as its development status in order to formulate a Cardano price prediction for December.Cardano Overview Cardano is",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "Tether (USDT) | CryptoSlate",
    "Link": "https://cryptoslate.com/coins/tether/",
    "Description": "Launched in 2014, Tether is a blockchain-enabled platform designed to facilitate the use of fiat currencies in a digital manner. Tether works to disrupt the conventional financial system via a more mo",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Mickey Mouse vs. Justin Sun: crypto community reacts to recent Tron trademark rejections",
    "Link": "https://cryptoslate.com/mickey-mouse-vs-justin-sun-crypto-community-reacts-to-recent-tron-trademark-rejections/",
    "Description": "The crypto community has been gripped by news that cryptocurrency company Tron had applications for three trademarks blocked by entertainment giant Disney.",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Bitcoin’s 2019 in Tech: What This Year Brought Us (Part 1)",
    "Link": "https://bitcoinmagazine.com/articles/bitcoins-2019-in-tech-what-this-year-brought-us-part-1",
    "Description": "Guix, Shamir Backups, P2EP and more\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Op Ed: U.S. Cryptocurrency Regulation Faces Uncertainty in 2020",
    "Link": "https://bitcoinmagazine.com/articles/op-ed-u-cryptocurrency-regulation-faces-uncertainty-2020",
    "Description": "The SEC, CFTC and Congress have hinted at how cryptocurrency regulation will develop in 2020. Here are five significant regulatory milestones from 2019.\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Worlds Top Cryptocurrency Influencers To Follow On Social Media In 2020",
    "Link": "https://www.coinjoker.in/bitcoin-news/worlds-top-cryptocurrency-influencers-to-follow-on-social-media-in-2020",
    "Description": "The push for cryptocurrency and blockchain global adoption is on the rise, and 2019 has been quite innovative for the two emerging technologies. As we engage the overdrive gear into 2020, it’s",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "Bitcoin Price Takes Aim at $7.4K Resistance — $7.6K by Monthly Close?",
    "Link": "https://cointelegraph.com/news/bitcoin-price-takes-aim-at-74k-resistance-76k-by-monthly-close",
    "Description": "Bitcoin price appears bullish on shorter time frames is likely to make another attempt at the $7.4K resistance but traders should expect volatility as the monthly close approaches.",
    "source": "cointelegraph.com"
  },
  {
    "Title": "Mati Greenspan Calls for a YouTube Boycott as it Slashes Crypto and Blockchain Content",
    "Link": "https://coingape.com/not-a-merry-christmas-for-bitcoin-and-crypto-due-to-youtube-ban-and-price-drop/",
    "Description": "YouTube is restricting the cryptocurrency and blockchain content on its website; many creators are getting affected by the update. The new update has the bot [...]",
    "source": "coingape.com"
  },
  {
    "Title": "Our 10 Favorite Bitcoin Magazine Podcasts of 2019",
    "Link": "https://bitcoinmagazine.com/articles/our-10-favorite-bitcoin-magazine-podcasts-of-2019",
    "Description": "2019 saw plenty of informative and captivating podcasts across Bitcoin. Here are Bitcoin Magazine’s favorites, just in time for your holiday break.\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Top 10 Cryptocurrency Companies To Watch Out For In 2020",
    "Link": "https://www.coinjoker.in/bitcoin-news/top-10-cryptocurrency-companies-to-watch-out-for-in-2020",
    "Description": "Cryptocurrencies continue to rise in popularity since their inception a decade ago. Their rise has been tremendous until they have started to affect the economic activities of certain countries. It",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "Math Research Suggests Six Confirmations Aren’t Really Needed for...",
    "Link": "https://bitcoinmagazine.com/articles/mathematics-research-suggests-six-confirmations-arent-really-needed-bitcoin-transactions",
    "Description": "In a recent research paper, a pair of mathematicians demonstrate that fewer Bitcoin confirmations might still be enough to avoid double-spend attacks.\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Op Ed: Waiting for Bitcoin Spring and the Next Bull Market",
    "Link": "https://bitcoinmagazine.com/articles/op-ed-waiting-bitcoin-spring-next-bull-market",
    "Description": "Although enthusiasm has been lacking in the current bitcoin market, some indicators out of China suggest a “bitcoin spring” may be on its way.\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Economic Uncertainty, Restrictions in Argentina Show Power of Bitcoin",
    "Link": "https://bitcoinmagazine.com/articles/economic-uncertainty-restrictions-in-argentina-show-power-of-bitcoin",
    "Description": "Among restrictions on forex investment and an unstable fiat economy, we explore the growing interest in and need for bitcoin in Argentina.\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Bitcoin [BTC] Price Flash: Indecision Grows as Bulls Exhibit Weakness above $7400",
    "Link": "https://coingape.com/bitcoin-price-indecision-fake-bounce/",
    "Description": "What looks like another dead-cat bounce in Bitcoin [BTC], it recorded a flash pump and dump in the final trading hours yesterday. Price rose to [...]",
    "source": "coingape.com"
  },
  {
    "Title": "Bitcoin [BTC] Price Remains in a Downtrend while Gold and Equity Markets Soar",
    "Link": "https://coingape.com/bitcoin-equity-downtrend-price/",
    "Description": "Bitcoin [BTC] has experienced two consecutive months of bears with a 33% drop from highs in November. What began as a bullish quarter with the [...]",
    "source": "coingape.com"
  },
  {
    "Title": "Will Altcoins Make a Comeback in 2020? Here's what Analysts Think",
    "Link": "https://coingape.com/altcoin-come-back-analysts-views/",
    "Description": "Bitcoin [BTC] price currently seems to be range bound in the $7000 range. Moreover, the past few weeks have been highly bearish for altcoins. Ethereum [...]",
    "source": "coingape.com"
  },
  {
    "Title": "Op Ed: Tendencies and Opportunities of Bitcoin Taxation in the EU",
    "Link": "https://bitcoinmagazine.com/articles/bitcoin-taxation-eu-tendencies-opportunities",
    "Description": "Each member state in the EU sets its own tax rules. It is still possible, however, to identify key trends and opportunities in cryptocurrency taxation. \n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Which Is The Best Litecoin Wallet Now Top 10",
    "Link": "https://www.coinjoker.in/bitcoin-news/which-is-the-best-litecoin-wallet-now--top-10",
    "Description": "As the push for cryptocurrency and blockchain adoption gains momentum, more users are joining the crypto space daily. Similarly, more wallets enter the market to match the growing number. However,",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "BTCPay Server Is Bitcoin’s Open-Source Unicorn",
    "Link": "https://bitcoinmagazine.com/articles/btcpay-server-is-bitcoins-open-source-unicorn",
    "Description": "Inside one of Bitcoin’s most inspiring projects\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Blockchain and Intellectual Property: Can Sony Achieve This Feat?",
    "Link": "https://www.cointelligence.com/content/blockchain-intellectual-property-sony/",
    "Description": "It's been a year since Sony announced they were going to use blockchain for DRM. Is blockchain an ideal solution for IP?",
    "source": "www.cointelligence.com"
  },
  {
    "Title": "Data shows $1 billion of trading volume in Binance and FTX combined | CryptoSlate",
    "Link": "https://cryptoslate.com/data-shows-1-billion-of-trading-volume-in-binance-and-ftx-combined/",
    "Description": "Binance made a strategic investment in the crypto derivatives trading platform FTX. The firms have combined trading volumes that surpass $1 billion.",
    "source": "cryptoslate.com"
  },
  {
    "Title": "Blockchain vulnerabilities and crypto robberies",
    "Link": "https://www.cointelligence.com/content/blockchain-vulnerabilities-crypto-robberies/",
    "Description": "An exploration of the strengths and vulnerabilities of blockchains, and why hacks and attacks sometimes succeed.",
    "source": "www.cointelligence.com"
  },
  {
    "Title": "Crypto Finance Conference",
    "Link": "https://www.cointelligence.com/content/events/crypto-finance-conference2020/",
    "Description": "Crypto Finance Conference is taking place in St. Moritz, Switzerland, 15 January '20. Learn more on our list of crypto events.",
    "source": "www.cointelligence.com"
  },
  {
    "Title": "Venezuela, Argentina Set New Weekly P2P Bitcoin Trading Volume Records",
    "Link": "https://cointelegraph.com/news/venezuela-argentina-set-new-weekly-p2p-bitcoin-trading-volume-records",
    "Description": "Bitcoin trading volumes on peer-to-peer trading platform LocalBitcoins in Venezuela and Argentina have touched on new all-time highs.",
    "source": "cointelegraph.com"
  },
  {
    "Title": "UN Secretary-General urges countries to embrace Blockchain technology. - Coinnounce",
    "Link": "https://coinnounce.com/un-secretary-general-urges-countries-to-embrace-blockchain-technology/",
    "Description": "United Nations secretary-general António Guterres said that the intergovernmental giant needs to embrace blockchain technology",
    "source": "coinnounce.com"
  },
  {
    "Title": "Learn how to calculate your crypto mining profitability",
    "Link": "https://www.cointelligence.com/content/crypto-mining-profitability/",
    "Description": "Do you know what factors go into calculating crypto mining profitability? Read our guide to learn how to figure out how much you'll really make!",
    "source": "www.cointelligence.com"
  },
  {
    "Title": "CME Bitcoin Futures Price Protects Key Level with Monthly Closing Due Tomorrow",
    "Link": "https://coingape.com/cme-bitcoin-monthly-closing/",
    "Description": "The expiry of Bitcoin [BTC] monthly futures contract on CME for December is due tomorrow. This will be the closing price of the futures contract [...]",
    "source": "coingape.com"
  },
  {
    "Title": "Crypto News Archives - Coinnounce",
    "Link": "https://coinnounce.com/category/cryptocurrency/crypto-news/",
    "Description": "",
    "source": "coinnounce.com"
  },
  {
    "Title": "Google removes Ethereum wallet client MetaMask from its app store - Coinnounce",
    "Link": "https://coinnounce.com/google-removes-metamask-from-its-app-store/",
    "Description": "Google has removed Ethereum wallet client MetaMask from its android app store. The appeal to reverse the ban has also been denied.",
    "source": "coinnounce.com"
  },
  {
    "Title": "Op Ed: Pitching Bitcoin During the Holidays",
    "Link": "https://bitcoinmagazine.com/articles/op-ed-pitching-bitcoin-holidays",
    "Description": "When it comes to pitching Bitcoin to your family and friends this holiday season, knowing your audience is key to spreading some Bitcoin cheer.\n",
    "source": "bitcoinmagazine.com"
  },
  {
    "Title": "Uzbekistan regulators ban citizens from buying cryptocurrencies. - Coinnounce",
    "Link": "https://coinnounce.com/uzbekistan-regulators-ban-citizens-from-buying-cryptocurrencies/",
    "Description": "Uzbekistan banned citizens from buying cryptocurrencies from licensed crypto exchanges in the country. The country legalized crypto trading in 2018.",
    "source": "coinnounce.com"
  },
  {
    "Title": "Craig Wright says bitcoin will never break above its current all-time high. - Coinnounce",
    "Link": "https://coinnounce.com/craig-wright-says-bitcoin-will-never-break-above-its-current-all-time-high/",
    "Description": "Self-proclaimed bitcoin inventor Craig Wright said that bitcoin will never break above its all-time high of nearly $20,000.",
    "source": "coinnounce.com"
  },
  {
    "Title": "Blockchain Archives - Coinnounce",
    "Link": "https://coinnounce.com/category/blockchain/",
    "Description": "",
    "source": "coinnounce.com"
  },
  {
    "Title": "Ethereum struggles to gain positive momentum, continues to trade below $125. - Coinnounce",
    "Link": "https://coinnounce.com/ethereum-struggles-to-gain-any-positive-momentum/",
    "Description": "The price of the second-largest cryptocurrency Ethereum took a huge blow this month as it dropped down more than 18% in just a few days.",
    "source": "coinnounce.com"
  },
  {
    "Title": "Bitcoin Archives - Coinnounce",
    "Link": "https://coinnounce.com/category/bitcoin/",
    "Description": "",
    "source": "coinnounce.com"
  },
  {
    "Title": "India's Payments Platform Vajra Gets the Blockchain Ball Rolling",
    "Link": "https://cointelegraph.com/news/indias-payments-platform-varja-gets-the-blockchain-ball-rolling",
    "Description": "Permissioned blockchain platform Vajra developed by National Payment Corporation of India is set to change the local industry.",
    "source": "cointelegraph.com"
  },
  {
    "Title": "Ripple plans to expand its presence in South American countries. - Coinnounce",
    "Link": "https://coinnounce.com/ripple-plans-to-expand-its-presence-in-south-american-countries/",
    "Description": "Ripple is expected to announce some major partnerships with Brazilian companies. Earlier, Ripple announced partnerships with major banks like Santander.",
    "source": "coinnounce.com"
  },
  {
    "Title": "Mike Blandina will replace Kelly Loeffler as the new CEO of Bakkt - Coinnounce",
    "Link": "https://coinnounce.com/mike-blandina-will-replace-kelly-loeffler-as-the-new-ceo-of-bakkt/",
    "Description": "Bitcoin futures exchange Bakkt has appointed Mike Blandina as the new chief executive officer of the company. Mike will replace Kelly Loeffler",
    "source": "coinnounce.com"
  },
  {
    "Title": "Top 10 Controversial Cryptocurrencies of 2019",
    "Link": "https://coingape.com/top-10-controversial-cryptocurrencies-2019/",
    "Description": "2019 has been a year of ups and downs. While the market recovered from its bearish mood of 2018, most top cryptocurrencies are well below [...]",
    "source": "coingape.com"
  },
  {
    "Title": "Altcoin Archives - Coinnounce",
    "Link": "https://coinnounce.com/category/altcoin/",
    "Description": "",
    "source": "coinnounce.com"
  },
  {
    "Title": "Latest news and Daily updates on Bitcoin | Coinjoker",
    "Link": "https://www.coinjoker.in/bitcoin-news",
    "Description": "Watch out the latest news and updates on bitcoin such as bitcoin price, market value. Live updates about the first open source cryptocurrency here.",
    "source": "www.coinjoker.in"
  },
  {
    "Title": "Trading Digital Assets",
    "Link": "https://www.cointelligence.com/content/events/trading-digital-assets/",
    "Description": "Trading Digital Assets is taking place in Tel Aviv, Israel, 29 December '19. Learn more on our list of crypto events.",
    "source": "www.cointelligence.com"
  },
  {
    "Title": "European Blockchain Convention Barcelona",
    "Link": "https://www.cointelligence.com/content/events/european-blockchain-convention-barcelona/",
    "Description": "European Blockchain Convention Barcelona is taking place in Barcelona, Spain, 20 January '20. Learn more on our list of crypto events.",
    "source": "www.cointelligence.com"
  },
  {
    "Title": "Optimizing your crypto taxes during bear market",
    "Link": "https://www.cointelligence.com/content/crypto-taxes-bear-market/",
    "Description": "Tax season is upon us (at least in the US) and you may have questions about taxes on your crypto, especially if the bear market has hit you hard.",
    "source": "www.cointelligence.com"
  },
  {
    "Title": "Vitalik Buterin Proposes Method to Speed Up Full Proof of Stake Delivery | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/24/vitalik-buterin-proposes-method-to-speed-up-full-proof-of-stake-delivery",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Bitcoin’s Market Cap Now Just 1/3rd of Visa | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/27/bitcoins-market-cap-now-just-1-3rd-of-visa",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Ethereum Co-Founder Sells 90,000 ETH | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/26/ethereum-co-founder-sells-90000-eth",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "China Seizes 7,000 Bitcoin Asics | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/23/china-seizes-7000-bitcoin-asics",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Anger Grows at Ethereum Hardfork Timing | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/23/dapp-developer-lashes-out-at-ethereum-hardfork-set-for-new-years-day",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Tor Running Decentralized Bitcoin Exchange Handles Millions a Week | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/22/tor-running-decentralized-bitcoin-exchange-handles-millions-a-week",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Press Release: TradeSanta and HitBTC Partnered to Make a 0% Trading Fee Offer | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/11/02/press-release-tradesanta-and-hitbtc-partnered-to-make-a-0-trading-fee-offer",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Block Rewards Drop to 10,000 ETH Amid Issuance Reduction Discussion | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/16/block-rewards-drop-to-10000-eth-amid-issuance-reduction-discussion",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "The Oldest Bitcoin Node Still Runs Seven Years On | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/23/the-oldest-bitcoin-node-still-runs-seven-years-on",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Can Ethereum Survive Without a Monetary Policy? | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/21/can-ethereum-survive-without-a-monetary-policy",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Bitcoin Bullwhale Reveals Investment Method | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/22/bitcoin-bullwhale-reveals-investment-method",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "70% of Ethereans Vote to Reduce Issuance to 1 ETH | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/22/70-of-ethereans-vote-to-reduce-issuance-to-1-eth",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Bitcoin Longs Reach All Time High But Price Still Falling Somehow | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/12/bitcoin-longs-reach-all-time-high-but-price-still-falling-somehow",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Press Release: A Few Games That Will Get You Into Cryptocurrency Even More | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/11/15/press-release-a-few-games-that-will-get-you-into-cryptocurrency-even-more",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Ethereum Google Searches Now Lower Than Even in 2016 | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/09/ethereum-google-searches-now-lower-than-even-in-2016",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Press Release: Cryptocurrency Slot Games Are Coming Soon | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/10/17/press-release-cryptocurrency-slot-games-are-coming-soon",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "“Ethereum Foundation to Stop Funding Most Internal Teams” Says Dev | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/07/ethereum-foundation-to-stop-funding-most-internal-teams-says-dev",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Ethereum Reddit Karma Points Now Worth $30,000 | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/07/ethereum-reddit-karma-points-now-worth-30000",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "75% of Nodes Have Now Upgraded as Ethereum Successfully Forks | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/08/75-of-nodes-have-now-upgraded-as-ethereum-successfully-forks",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Russia v US Battle Over Alleged MT Gox Bitcoin Hacker Ends Up With… France? | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/23/russia-v-us-battle-over-alleged-bitcoin-hacker-ends-up-with-france",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Bitcoin BullWhale Stuns | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/18/bitcoin-bullwhale-stuns",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "A Ponzi Scam is Now a Top Ten Holder of ETH | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/11/a-ponzi-scam-is-now-a-top-ten-holder-of-eth",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Parity Urges Urgent Upgrade as They Forgot to Include an EIP Hours Before Ethereum Fork | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/06/parity-urges-urgent-upgrade-as-they-forgot-to-include-an-eip-hours-before-ethereum-fork",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Guy on Bitmex Market Buys $9 Million Bitcoin, Then Market Sells $9 Million | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/22/guy-on-bitmex-market-buys-9-million-bitcoin-then-market-sells-9-million",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "10% of Bitcoin Cash Double Spending Attempts Are Successful | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/19/10-of-bitcoin-cash-double-spending-attempts-are-successful",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "The Mystery of 12 Million ETH | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/27/the-mystery-of-12-million-eth",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Press Release: Gambling Industry Assists Certain Cryptos to Maintain Their Growth | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/10/29/press-release-gambling-industry-assists-certain-cryptos-to-maintain-their-growth",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Ethereum Foundation Sold $100 Million at the Top Says Vitalik Buterin | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/13/ethereum-foundation-sold-100-million-at-the-top-says-vitalik-buterin",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Ethereum Transactions Plunge | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/09/ethereum-transactions-plunge",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Guy Gives Bitcoin Book to Police at DUI Checkpoint | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/23/guy-gives-bitcoin-book-to-police-at-dui-checkpoint",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Ethereum 2.0 Audit Expected by February | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/20/ethereum-2-0-audit-expected-by-february",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Cardano Launches Proof of Stake | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/17/cardano-launches-proof-of-stake",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Vitalik Buterin Crashed Ethereum’s Price Blockchain Analysis Shows | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/16/vitalik-buterin-crashed-ethereums-price-blockchain-analysis-shows",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Apple and Microsoft Now Worth More Than All German Stocks and Cryptos | Trustnodes",
    "Link": "https://www.trustnodes.com/2019/12/27/apple-and-microsoft-now-worth-more-than-all-german-stocks-and-cryptos",
    "Description": "All the latests news on Crypto, Blockchain, Bitcoin, Ethereum, Tokens, ICOs, Fintech, and more.",
    "source": "www.trustnodes.com"
  },
  {
    "Title": "Top Analyst: XRP Has Room to Run as Price Moves to $0.31 - Ethereum World News",
    "Link": "https://ethereumworldnews.com/analyst-xrp-room-to-run-price-31-cents/",
    "Description": "Christmas may be coming early for holders of XRP, the third-largest cryptocurrency by market capitalization. As of the time of writing this, the popular altcoin has found itself trading just under 3% ",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "The North American Bitcoin Conference",
    "Link": "https://www.cointelligence.com/content/events/the-north-american-bitcoin-conference/",
    "Description": "The North American Bitcoin Conference is taking place in Miami, FL, 15 January '20. Learn more on our list of crypto events.",
    "source": "www.cointelligence.com"
  },
  {
    "Title": "Analyst Expects EOS to See Further Weakness as Crypto Markets Falter",
    "Link": "https://ethereumworldnews.com/analyst-expects-eos-to-see-further-weakness/",
    "Description": "One analyst is noting that he expects EOS to see downwards pressure in the near-term, but is also adding that it does have the potential to outperform Ethereum",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "XRP Surges 7% as Technical Strength Builds; Here's What Analysts are Saying",
    "Link": "https://ethereumworldnews.com/xrp-surges-7-as-technical-strength-builds-heres-what-analysts-are-saying/",
    "Description": "Analysts are noting that XRP’s recent price action has allowed it to strengthen its technical formations, which could bolster its price action in the near term",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Bitcoin Breaks Above Key Resistance Level; Is a Trend Shift Imminent?",
    "Link": "https://ethereumworldnews.com/bitcoin-breaks-above-key-resistance-level/",
    "Description": "Bitcoin is currently expressing some signs of bullishness after finding significant buying pressure within the upper-$7,000 region yesterday.",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Ethereum (ETH) Price Will Reach at Least $3,300 Next Bull Market",
    "Link": "https://ethereumworldnews.com/ethereum-eth-price-will-reach-at-least-3300-next-bull-market/",
    "Description": "Indeed, altcoins, including Ethereum and XRP, have suffered heavy losses this year, both in terms of price and investor interest. Altcoins are doing so poor, in fact, that the Bitcoin dominance metric",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Blockchain Analytics Firm CipherTrace to Support Traceability for Binance Chain, BNB - Ethereum World News",
    "Link": "https://ethereumworldnews.com/blockchain-analystics-firm-ciphertrace-to-support-traceability-for-binance-chain-bnb/",
    "Description": "CipherTrace, a leading blockchain and Big Data analytics firm, announced it has added support for Binance Chain and Binance's native BNB token.",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Analysts Expect Bitcoin Price Breakout as BTC Holds in $9,000 Range - Ethereum World News",
    "Link": "https://ethereumworldnews.com/analysts-expect-bitcoin-breakout-as-price-returns-to-9400/",
    "Description": "Yesterday, Bitcoin (BTC) plunged by $300 in literal minutes, falling to as low as $9,200 after consolidating in and around $9,500. There were many saying that this flash crash-esque move validated the",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Bakkt Hype Fades as Bitcoin Nears Critical Support Level",
    "Link": "https://ethereumworldnews.com/bakkt-hype-fades-as-bitcoin-nears-support/",
    "Description": "Bakkt's lackluster launch has faded the hype surrounding the platform, which comes as Bitcoin nears a critical support level.",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Bitpanda launches their Global Exchange after having raised €43.6 million in the most successful European IEO to date - Ethereum World News",
    "Link": "https://ethereumworldnews.com/bitpanda-launches-their-global-exchange-after-having-raised-e43-6-million-in-the-most-successful-european-ieo-to-date/",
    "Description": "About Bitpanda",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Ethereum DeFi Products Hit Milestone as ETH Falls Against Bitcoin - Ethereum World News",
    "Link": "https://ethereumworldnews.com/ethereum-defi-milestone-eth-falls-bitcoin/",
    "Description": "Decentralized finance, best known as DeFi, has rapidly gained steam on Ethereum — despite the fact that ETH is currently falling against Bitcoin, reaching multi-year lows over the past few weeks.",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Accounting and Consulting Firm Armanino Launches Blockchain-based Software Tool - Ethereum World News",
    "Link": "https://ethereumworldnews.com/accounting-and-consulting-firm-armanino-launches-blockchain-based-software-tool/",
    "Description": "California-based Armanino, an accounting and business consulting company, has introduced a new blockchain-powered software tool.",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Ethereum Istanbul Imminent But ETH Price Still Plunging",
    "Link": "https://ethereumworldnews.com/ethereum-istanbul-imminent-but-eth-price-still-plunging/",
    "Description": "A major network upgrade or hard fork is usually bullish for a crypto project. Ethereum has long been subject to indignation from its adversaries for its lack of scalability and network problems when u",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Analyst Targets 10% Upside for Bitcoin As BTC Manages to Hold $8,000 - EWN",
    "Link": "https://ethereumworldnews.com/analyst-upside-bitcoin-price-btc-manages-8000/",
    "Description": "Over the past 48 hours, Bitcoin (BTC) price has started to show some strength. After the brutal drawdowns that were seen early this week, which saw BTC unravel to $7,700 from $10,200 in a few days' ti",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Bitcoin Fractals May Indicate Next Move as Consolation Continues - Ethereum World News",
    "Link": "https://ethereumworldnews.com/bitcoin-fractals-may-indicate-next-move-as-consolation-continues/",
    "Description": "Another day has passed with very little activity on Bitcoin markets. The king of crypto continues to consolidate as its trading channel tightens up in anticipation of another big move. Technical indic",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Bakkt Is Good For Bitcoin And Ethereum Too – Market Hasn't Priced That In Yet",
    "Link": "https://ethereumworldnews.com/bakkt-is-good-for-bitcoin-but-ethereum-too-and-market-hasnt-priced-it-in-yet/",
    "Description": "Bakkt’s bitcoin futures launch on 23 September is a shot in the arm for crypto, but in addition to boosting bitcoin it could also raise the profile of Ethereum. Here's why.",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Almost 7% of Bitcoin's Circulating Supply Resides in Exchange Wallets, Demand for \"Hard Assets\" Is Increasing: Report - Ethereum World News",
    "Link": "https://ethereumworldnews.com/almost-7-of-bitcoins-circulating-supply-resides-in-exchange-wallets-demand-for-hard-assets-is-increasing-report/",
    "Description": "Nearly 7% of Bitcoin’s (BTC) total circulating supply resides in the wallets of eight major digital asset exchanges, according to The Token Analyst.",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "AI-Enhanced Crypto Investment App Developer Ember Fund to Raise $1 Million - Ethereum World News",
    "Link": "https://ethereumworldnews.com/ai-enhanced-crypto-investment-app-developer-ember-fund-to-raise-1-million/",
    "Description": "Ember Fund, the developer of an artificial intelligence (AI)-enhanced digital asset portfolio app, is planning to raise as much as $1 million.",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Stellar (XLM) Surges 14% Following SDF's Massive 55 Billion Lumens Token Burn - Ethereum World News",
    "Link": "https://ethereumworldnews.com/stellar-xlm-surges-following-sdfs-massive-55-billion-lumens-token-burn/",
    "Description": "The Stellar Development Foundation has burned 55 billion of its XLM tokens, which accounts for half of the digital currency’s circulating supply.",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "DGaming Puts Ethereum Tokens On Sale to Boost Decentralized Gaming - Ethereum World News",
    "Link": "https://ethereumworldnews.com/dgaming-puts-ethereum-and-eos-tokens-on-sale-to-boost-decentralized-gaming-economy/",
    "Description": "It is clear that gaming is becoming a global industry. Just recently, the Fortnite World Cup, sponsored by FIFA, took place in New York. Tens of thousands of people descended on a stadium to watch gam",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Analysts: Ethereum Strong, May Soon Breakout Against Bitcoin - EWN",
    "Link": "https://ethereumworldnews.com/analysts-ethereum-breakout-bitcoin-price/",
    "Description": "At long last, Ethereum is finally showing some price strength against Bitcoin. The ETH/BTC trading pair, which has been collapsing dramatically for over a year, is purportedly starting to show signs o",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Bittrex Now Also a Target of a 100 Bitcoin (BTC) SIM Hack Lawsuit - Ethereum World News",
    "Link": "https://ethereumworldnews.com/bittrex-now-also-a-target-a-100-bitcoin-btc-sim-hack-lawsuit/",
    "Description": "Digital asset exchange Bittrex is being sued over a SIM swap-related incident that allowed hackers to steal 100 Bitcoin (BTC).",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Massive Ethereum \"Ponzi Scheme\" FairWin Is Vulnerable, ETH Devs Find - EWN",
    "Link": "https://ethereumworldnews.com/massive-ethereum-ponzi-fairwin-vulnerable/",
    "Description": "As covered heavily by this outlet over recent weeks, the Ethereum network has been seeing more activity than ever before. In fact, the network has been used so much that miners of ETH recently opted t",
    "source": "ethereumworldnews.com"
  },
  {
    "Title": "Geneva Blockchain Congress",
    "Link": "https://www.cointelligence.com/content/events/geneva-blockchain-congress/",
    "Description": "Geneva Blockchain Congress is taking place in Geneva, Switzerland, 20 January '20. Learn more on our list of crypto events.",
    "source": "www.cointelligence.com"
  },
  {
    "Title": "ECB Proposes New Crypto Payment System with ‘Controllable Anonymity’",
    "Link": "https://www.financemagnates.com/cryptocurrency/news/ecb-proposes-new-crypto-payment-system-with-controllable-anonymity/",
    "Description": "European Central Bank (ECB) has published a new study that proposes a new model to balance functionality of cryptocurrencies with concerns about anonymity and AML risks.",
    "source": "www.financemagnates.com"
  }
]